{"source": "CNBC", "title": "European stocks move lower ahead of Trump-Ukraine crunch talks", "content": "LONDON — European stocks lost some ground on Monday as traders looked ahead to a meeting between regional leaders and U.S. President Donald Trump to discuss Ukraine.The pan-EuropeanStoxx 600index was 0.2% lower by 11:19 a.m. in London (6:19 a.m. ET), with most sectors and all major bourses in negative territory. European leaders, including German Chancellor Friedrich Merz, French President Emmanuel Macron and British Prime Minister Keir Starmer, are traveling with Ukraine's Volodymyr Zelenskyy to Washington to meet Trump at the White House to discuss a peace deal.Zelenskyy is likely to come under pressure to enter a deal.In a post on Truth Social,Trump said the president could \"end the war with Russia almost immediately, if he wants to, or he can continue to fight.\"The meeting follows Trump's summit with Russian President Vladimir Putin last Friday, but the talks concluded without a ceasefire. It's been widely reported since then that Putin told Trump that he would agree to one,if Russia was handed Ukraine's eastern Donbas region. On Sunday, U.S. special envoySteve Witkoffsuggested Ukrainecould be given some security guaranteesto bring an end to the war. Looking at individual stocks, shares of Danish wind turbine manufacturerVestas Windsurged 16.5% by 11:20 a.m. in London, taking the company to the top of the Stoxx 600.The gain came after the U.S. Internal Revenue Serviceissued new rulesaround tax credits for clean energy projects. Under the new system, developers will only be able to qualify once physical work on the project begins. Previously, they were able to claim tax relief by paying at least 5% of project costs and demonstrating that some form of work on the project was ongoing.Meanwhile, shares of Danish pharmaceutical giantNovo Nordiskwere up by 4% after the company's blockbuster weight-loss drug Wegovywon regulatory approvalin the United States to treat a serious liver disease.At the other end of the Stoxx 600,Commerzbankwas 3.3% lower in late morning trade in London.The German lender was downgraded by strategists at Deutsche Bank on Monday, who lowered the stock from a \"buy\" rating to a \"hold.\"\"We continue to like the fundamental Commerzbank story, including rising profitability and capital return, as well as the upcoming benefits from the German fiscal stimulus,\" Deutsche Bank's Benjamin Goy said in a note. \"Nevertheless, after tripling over the last year, the shares now trade at a 20% to 42% P/E premium to the sector, even on our above-consensus forecasts.\"Overnight,Asia-Pacific marketsmostly rose ahead of the talks, whileU.S. stock futurestraded slightly higher early Monday after hopes for lower interest rates fueled a winning week on Wall Street.There are no major earnings on Monday. Data releases include Spanish and EU trade balance figures.", "url": "https://www.cnbc.com/2025/08/18/european-markets-on-mon-aug-18-stoxx-600-dax-cac-ftse-stocks.html", "timestamp": "2025-08-18T11:08:04.644301", "sentiment_score": -0.8515999913215637, "symbol": "WELL"}
{"source": "CNBC", "title": "Traders hope the Ukraine war ends soon. Experts say there's no 'quick fix'", "content": "Global markets were on tenterhooks Monday as momentum to end the war in Ukraine ramped up.Experts warn there is no \"quick fix,\" however, and talks could last years.European leaders and Ukraine's Volodymyr Zelenskyy are heading to Washington for more discussions with U.S. President Donald Trump on ending the war in Ukraine. Global markets were on tenterhooks Monday as momentum to end the war in Ukraine appeared to be ramping up, with European leaders heading to Washington for more talks with U.S. President Donald Trump on ending the war in Ukraine.European markets traded mixedahead of the summit later today at the White House, which followsTrump's high-profile meeting with Russian President Vladimir Putinin Alaska on Friday, whileU.S. stock futures had moved lower.Meanwhile,Asia-Pacific indicesovernight traded mostly higher in anticipation of the talks.Traders will be hoping that an end to the Russia-Ukraine war — a conflict which began in 2022 and which has shaken the global economy, disrupting trade and supply chains, and creating geopolitical chasms between major economies in the West and East — could be nearer now than at any other time.But those in the know say fledgling talks between stakeholders Russia, Ukraine, Europe and the U.S. are just the beginning of what could be a long and thorny path to a ceasefire — as Trump's inconclusive talks with Putin on Friday proved — let alone peace.That would be in stark contrast to Trump's well-documented love of a quick deal, and should be a wake-up call for global market optimism, experts say.\"Peace agreements take a very, very long time to achieve,\" James Bindenagel, visiting fellow at the German Marshall Fund and former U.S. ambassador to Germany, told CNBC Monday. \"And what Putin has said is that he wants peace talks so he can continue the war, knowing that it won't come to a peace agreement for a very long time. That is simply not acceptable,\" he said.\"You cannot negotiate on a peace agreement for five years, ten years, and let the Russians continue their war against the Ukrainians.\" European Commission President Ursula von der Leyen, NATO chief Mark Rutte, German Chancellor Friedrich Merz, French President Emmanuel Macron and British Prime Minister Keir Starmer are among the European leaders traveling to Washington for talks on Monday.They're accompanying Ukraine's President Volodymyr Zelenskyy to discuss Ukraine's future and possible conditions for a peace deal, including land swaps (reportedly proposed by Putin) and security guarantees — all seen as crucial by Europe, if there is to be a ceasefire and peace. Trump has ruled out the possibility of Ukraine regaining control of Crimea, which Russia invaded in 2014, and joining NATO. Zelenskyy is likely to come under pressure to enter a deal.In a post on Truth Social,Trump said the Ukrainian president could \"end the war with Russia almost immediately, if he wants to, or he can continue to fight.\"The meeting follows Trump's summit with Russian President Vladimir Putin last Friday, but the talks concluded without a ceasefire. It's been widely reported since then that Putin told Trump that he would agree to one,if Russia was handed Ukraine's eastern Donbas region.The view from Ukraine is not optimistic, considering that Putin had already rejected the offer of a ceasefire that could form the basis of peace negotiations. \"To achieve a big peace deal is much more difficult,\" Oleksiy Goncharenko, a Ukrainian lawmaker, told CNBC on Monday. \"It's a difficult question with big details and it will take a lot of time,\" he told CNBC's \"Europe Early Edition.\" European defense stocks were in focus Monday, with traders betting on a positive outlook for the sector whatever the outcome of talks as European leaders have pledged to increase defense spending.On Monday, Germany'sRheinmetallwas up 2.8%, whileHensoldtandRenkwere also around 4% higher, respectively. Italian firm Leonardo was up 2.1% in early deals while London-listedBAE Systemsalso traded 2.3% higher andBabcock3.4% higher.\"This is the beginning of a long negotiation,\" Olivia Allison, senior advisor at PRISM Strategic Intelligence, told CNBC Monday. \"Anyone looking for a quick fix will be disappointed,\" she noted. \"Regardless of the outcome ... there will be an emphasis on defense, on protecting critical national infrastructure, and I think the markets should also take that into account,\" she noted.\"A peace deal, which I think will be a long process, is not an end to the relationship between Russia and Europe.\"", "url": "https://www.cnbc.com/2025/08/18/markets-hope-ukraine-war-could-end-experts-say-theres-no-quick-fix.html", "timestamp": "2025-08-18T11:08:09.166358", "sentiment_score": -0.5778999924659729, "symbol": "WELL"}
{"source": "CoinDesk", "title": "Metaplanet Expands Bitcoin Treasury by 775 BTC, Assets Outweigh Debt 18-Fold", "content": "Tokyo-listedMetaplanet Inc(3350)has acquired an additional 775 bitcoinBTC$115,244.11for 13.73 billion yen(about $94 million), according to its most recent filing. The purchase, made at an average price of 17.72 million yen($120,500)per bitcoin, lifts the company’s total holdings to 18,888 BTC, worth roughly 284.1 billion yen($1.95 billion). This purchase keeps them as the seventh largest bitcoin treasury company. Across all purchases, Metaplanet’s average acquisition cost now stands at 15.04 million yen per BTC($102,100). The company reported a Bitcoin Yield of 29.3% for the latest period, down from 129.4% in Q2. Its multiple to net asset value remains near 2, the lowest since it began its BTC accumulation. The company carries $117 million in outstanding debt, Metaplanet’s leverage is minimal compared to its bitcoin reserves. “Metaplanet now hold $2.18 billion in BTC against just $120 million of outstanding 0% ordinary bonds,” saidDylan LeClair, director of bitcoin strategy. “Our 19th Series Ordinary Bonds are 18.67x over-collateralized by our BTC position, and currently represent the sole liability within our capital structure.” Shares of Metaplanet rose 4% to close at 900 yen on Monday, even as bitcoin slipped to$115,500, reflecting investor confidence in the firm’s balance sheet strategy. James Van Stratenis a Senior Analyst at CoinDesk, specializing in Bitcoin and its interplay with the macroeconomic environment. Previously, James worked as a Research Analyst at Saidler & Co., a Swiss hedge fund, where he developed expertise in on-chain analytics. His work focuses on monitoring flows to analyze Bitcoin's role within the broader financial system. In addition to his professional endeavors, James serves as an advisor to Coinsilium, a UK publicly traded company, where he provides guidance on their Bitcoin treasury strategy. He also holds investments in Bitcoin and Strategy (MSTR). More For You Bitcoin Drops Below $115K Amid Wave of Profit-Taking Approximately, $3.5B of profit realized over the weekend, latest correction trims 7% from ATH. What to know: About Contact", "url": "https://www.coindesk.com/markets/2025/08/18/metaplanet-expands-bitcoin-treasury-by-775-btc-assets-outweigh-debt-18-fold", "timestamp": "2025-08-18T11:09:02.855851", "sentiment_score": -0.8338000178337097, "symbol": "COST"}
{"source": "CoinDesk", "title": "Solana Briefly Hits 100K TPS Under Stress Load, Boosting SOL Appeal", "content": "Solana briefly recorded more than 100,000 transactions per second(TPS)on its mainnet over the weekend,block datashows.  A block processed 43,016 successful transactions and 50 failed ones for a peak of 107,540 TPS, facilitated and processed by validator “Cavey Cool.”  Solana just did 107,540 TPS on mainnetyes, you read that correctlyover 100k TPS, on mainnetgood luck bearspic.twitter.com/nGF9Q1b86c  The spike was driven by no-operation, or “noop,” program calls, or lightweight instructions required in every transaction that don’t change state but can be used to stress-test network capacity.  Critics argue that such loads are artificial. But Helius CEO Mert Mumtaz said in an X post that the cost to the network wasn’t trivial: While execution compute units(CUs)are low, the “total cost” also accounts for signature verification, data loading and other non-execution overhead. That makes them comparable to a low-cost oracle update, rather than meaningless spam. there are also some technical details around thise.g one might point out the nature of the CUs for these calls, but it's more nuanced since there's also a \"total cost\" component to these (sig verify, data loading, etc) which also takes into account non-execution CUsand as…  As such, actual user-facing throughput is far lower as of Monday morning. On-chain trackerSolscan shows an average of 3,500 TPS, nearly two-thirds of which are validator vote transactions. Chainspect and Solscan peg effective throughput for payments and applications at roughly 1,000 TPS. Still, the data showed that Solana could theoretically sustain 80,000–100,000 TPS in real operations like transfers or oracle updates under peak conditions — improving the appeal of the network’s SOL(SOL)token. Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.Shaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.He provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. More For You Bitcoin Drops Below $115K Amid Wave of Profit-Taking Approximately, $3.5B of profit realized over the weekend, latest correction trims 7% from ATH. What to know: About Contact", "url": "https://www.coindesk.com/markets/2025/08/18/solana-briefly-hits-100k-tps-under-stress-load-boosting-sol-appeal", "timestamp": "2025-08-18T11:09:04.194756", "sentiment_score": -0.09269999712705612, "symbol": "ORCL"}
{"source": "CoinDesk", "title": "Ether Market May Become More Exciting Below $4.2K. Here Is Why.", "content": "Crypto traders should remain vigilant for an ether(ETH)price drop below $4,200, which could trigger millions in long liquidations and increase market volatility. As of writing, over 56,638 ETH in bullish long positions – valued at $236 million – faced liquidation risk on the decentralized perpetual exchange Hyperliquid in case of an ether price drop to $4,170, according to data from Hyperdash. The data also showed a risk of sizable liquidations at $2,150-$2,160 and $3,940. At press time, ether changed hands at $4,260, down nearly 5% on the day, according to CoinDesk data. Andrew Kang, founder of the crypto venture capital firm Mechanism Capital, stated on X that large long liquidations could potentially drive ether prices down to $3,600. \"[I] would estimate we're about to hit $5b in ETH liquidations across exchanges, taking us down to $3.2k - $3.6k,\" Kang said. Liquidations, or the forced closure of leveraged bets, happen when a trader's position falls short of the margin requirements set by the exchange. The margin shortage typically occurs when the market moves against the trader's position, causing their account equity to fall below the minimum maintenance margin. This prompts the exchange to automatically close the position to prevent further losses and ensure borrowed funds are recovered. Largely long liquidations cause a sudden surge in selling pressure, which pushes prices even lower, creating a cascading effect that can trigger additional liquidations. This negative feedback loop tends to amplify market volatility. Read more:Dogecoin Sellers in Control as Monero Attacker Votes to Target DOGE; Bitcoin Below $116K Omkar Godbole is a Co-Managing Editor and analyst on CoinDesk's Markets team. He has been covering crypto options and futures, as well as macro and cross-asset activity, since 2019, leveraging his prior experience in directional and non-directional derivative strategies at brokerage firms. His extensive background also encompasses the FX markets, having served as a fundamental analyst at currency and commodities desks for Mumbai-based brokerages and FXStreet. Omkar holds small amounts of bitcoin, ether, BitTorrent, tron and dot.Omkar holds a Master's degree in Finance and a Chartered Market Technician (CMT) designation. “AI Boost” indicates a generative text tool, typically an AI chatbot, contributed to the article. In each and every case, the article was edited, fact-checked and published by a human.Read more about CoinDesk's AI Policy. More For You Bitcoin Drops Below $115K Amid Wave of Profit-Taking Approximately, $3.5B of profit realized over the weekend, latest correction trims 7% from ATH. What to know: About Contact", "url": "https://www.coindesk.com/markets/2025/08/18/ether-market-may-become-more-exciting-below-usd4-2k-here-is-why", "timestamp": "2025-08-18T11:09:05.808182", "sentiment_score": -0.9567999839782715, "symbol": "TGT"}
{"source": "Financial Times", "title": "Citi raid on JPMorgan investment bankers reaches double digits", "content": " Arash Massoudiin London andAkila Quinioin New York PublishedAugust 18 2025 Simply sign up to theUS banksmyFT Digest -- delivered directly to your inbox. Citigroup’s banking chief Vis Raghavan has accelerated a hiring spree of former JPMorgan Chase colleagues, with at least 10 senior investment bankers having now agreed to join the rival US bank. In the past month, Citi has named Amit Nayyar as co-head of European technology banking, Guillermo Baygual as co-head of global M&A, Pankaj Goel as co-head of technology investment banking, BJ Vargas as head of North American equity capital markets and Ashish Agarwal as a senior real estate banker. All five men held senior roles in JPMorgan’s investment bank. Raghavan worked at JPMorgan for more than 20 years, and was named global head of investment banking there before he quit to lead the turnaround of Citi’s corporate, commercial and investment banking business. The latest recruits joina cohort of fiveother ex-JPMorgan bankers who have already taken up senior roles in Citi’s investment bank. Chief among those was Achintya Mangla, widely seen as Raghavan’s trusted lieutenant at JPMorgan, who now heads financing for investment banking at Citi. Raghavan started at Citi in June last year, and the bank’s recruitment effort has gone into overdrive since his non-solicit agreement with JPMorgan expired. David Lomer, who worked with Raghavan until 2022 when he moved to private capital group ICG, is also expected to make the jump to Citi, according to people with knowledge of the matter. Lomer, who served as head of ICG’s UK, Nordics and Benelux markets, has already resigned and is on gardening leave until later this year, some of the people said. ICG and Citi declined to comment. “What’s unusual here is the speed with which it is happening,” one veteran investment banker said about the recruitment drive. “The first thing you are trying to do is upgrade your talent. The second thing is political. You put your people in place so that your lieutenants can push your agenda forward in a large and complex organisation.” Citi has also recruited from outside Raghavan’s former colleagues at JPMorgan, with three senior hires from Goldman Sachs. Those include David Friedland, a partner who left the bank after 25 years to become co-head of North America investment banking coverage. The bank has also brought in Aashish Dhakad from Ares Management, as it seeks to grow its direct lending business through a $25bn private credit venture with Apollo. Citi’s investment bank has gained market share in the last year and ranks fifth globally in investment banking revenue with a 4.5 per cent market share according to Dealogic. Speaking at a conference organised by Morgan Stanley in June, Raghavan attributed the climb to the fact the bank was “hiring a lot of people” and said Citi was “just getting started in terms of talent investment”. Its investment banking fees rose 13 per cent in the second quarter as the bank advised on high-profile deals, including Nippon Steel’s $15bn acquisition of US Steel and Boeing’s sale of parts of its aviation software unit to Thoma Bravo. JPMorgan recently said it has hired more than 300 bankers since early 2024. A person close to the bank added that nearly a third of those roles were at managing director level.", "url": "https://www.ft.com/content/537018c0-0d04-4229-82b4-95809aac0e0e", "timestamp": "2025-08-18T11:09:12.848539", "sentiment_score": 0.16110000014305115, "symbol": "JPM"}
{"source": "Financial Times", "title": "Soho House close to $1.8bn take-private deal", "content": " James Fontanella-Khanin New York PublishedAugust 18 2025 Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Soho House, the once-edgy London members’ club that turned exclusivity into a global business, is set to retreat from public markets in a deal led by one of the biggest US hotel owners. A group of investors headed by New York-based MCR Hotels — which owns 30,000 guest rooms across the US, including the1960s-themed TWA Hotel at JFK airport— is nearing an agreement to buy out Soho House’s remaining public shareholders at about $9 a share, according to people familiar with the matter. The take-private offer values the company at roughly $1.8bn, excluding debt, and hands investors a premium over Friday’s $7.60 close — though still well shy of the $14 price tag whenSoho House floated in 2021. A deal could be announced as early as this week. Ron Burkle, the club’s billionaire backer who has long controlled the group, will roll over his stake along with other existing investors, people briefed about the matter said. Apollo Global Management, the alternative asset manager, is expected to provide more than $800mn in debt and equity financing, the people added. The deal would draw a line under months of agitation by activist Dan Loeb. His Third Point hedge fund had pressed the board to seek outside suitors to secure a higher valuation. Recommended Soho House’s take-private move comes after the company has struggled as a public company. Last year, New York short sellerGlassHouse slammedwhat it called a “broken business model and terrible accounting”, claiming the group’s expansion into less affluent cities betrayed its brand and masked the fact it had never turned a profit in its 28-year history. Management hit back with an independent review that, it said, found “no material issues” in the company’s books. Over the past few quarters, the business has shown signs of turning a corner. Earlier this month, it reported its third straight quarterly profit. The Wall Street Journal first reported news of the potential deal.", "url": "https://www.ft.com/content/714d00d6-b2fa-47d7-9b03-c2629af99882", "timestamp": "2025-08-18T11:09:16.032621", "sentiment_score": -0.12389999628067017, "symbol": "APO"}
{"source": "TechCrunch", "title": "‘Stranger Things’ creators may be leaving Netflix", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Netflix could soon lose the creative team behind one of its biggest hits. Earlier this week, Variety and other Hollywood publications reported that Matt and Ross Duffer, the brothers who created “Stranger Things” (and wrote and directed many episodes), werein talks to sign an exclusive deal with Paramount(nowunder the ownership of David Ellison’s Skydance). Then on Friday evening,Puck’s Matthew Belloni postedthat the Duffers had in fact “made their choice” and were going to Paramount. The Duffer Brothers’ ambition seems to have increased with each season of “Stranger Things,” as episodes have grown longer, set pieces have become more spectacular, and the budget has grown accordingly, witha reported Season 4 cost of $30 million per episode. So it’s not surprising that the Duffers are interested in making big-budget, tentpole movies next — an area where Netflix has struggled, in part due to its thorny relationship with the theatrical business, which co-CEOTed Sarandos recently describedas an “outdated concept.” While Netflix does release some movies in theaters, it has resisted giving those releases a significant exclusive window before launching on streaming, which means Netflix movies usually aren’t shown by the major chains. This was, apparently, a sticking point for “Barbie” director Greta Gerwig, so the first of her “Narnia” movies for Netflix willplay exclusively on Imax screensfor two weeks (or more) before going to streaming on Christmas Day 2026. And it seems this was also important to the Duffers, with Belloni reporting that the “theatrical component” turned out to be the “dealbreaker” in their negotiations. The brothers’ absence will not be immediately noticeable on Netflix, which will be releasing the final season of “Stranger Things” in three (!) parts later this year, and where the Duffers have two new shows scheduled to launch in 2026. Plus, the “Stranger Things” empire is growing, witha prequelplaying on Broadway,an animated seriescoming soon, and a live action spinoff reportedly in the works. Topics Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/17/stranger-things-creators-may-be-leaving-netflix/", "timestamp": "2025-08-18T11:09:17.268934", "sentiment_score": -0.8694999814033508, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Anthropic hasannounced new capabilitiesthat will allow some of its newest, largest models to end conversations in what the company describes as “rare, extreme cases of persistently harmful or abusive user interactions.” Strikingly, Anthropic says it’s doing this not to protect the human user, but rather the AI model itself. To be clear, the company isn’t claiming that its Claude AI models are sentient or can be harmed by their conversations with users. In its own words, Anthropic remains “highly uncertain about the potential moral status of Claude and other LLMs, now or in the future.” However, its announcement points toa recent program created to study what it calls “model welfare” and says Anthropic is essentially taking a just-in-case approach, “working to identify and implement low-cost interventions to mitigate risks to model welfare, in case such welfare is possible.” This latest change is currently limited to Claude Opus 4 and 4.1. And again, it’s only supposed to happen in “extreme edge cases,” such as “requests from users for sexual content involving minors and attempts to solicit information that would enable large-scale violence or acts of terror.” While those types of requests could potentially create legal or publicity problems for Anthropic itself (witness recent reporting around howChatGPT can potentially reinforce or contribute to its users’ delusional thinking), the company says that in pre-deployment testing, Claude Opus 4 showed a “strong preference against” responding to these requests and a “pattern of apparent distress” when it did so. As for these new conversation-ending capabilities, the company says, “In all cases, Claude is only to use its conversation-ending ability as a last resort when multiple attempts at redirection have failed and hope of a productive interaction has been exhausted, or when a user explicitly asks Claude to end a chat.” Anthropic also says Claude has been “directed not to use this ability in cases where users might be at imminent risk of harming themselves or others.” When Claude does end a conversation, Anthropic says users will still be able to start new conversations from the same account, and to create new branches of the troublesome conversation by editing their responses. “We’re treating this feature as an ongoing experiment and will continue refining our approach,” the company says. Topics Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/16/anthropic-says-some-claude-models-can-now-end-harmful-or-abusive-conversations/", "timestamp": "2025-08-18T11:09:18.342009", "sentiment_score": -0.05220000073313713, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "Sam Altman, over bread rolls, explores life after GPT-5", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us I’m looking out at Alcatraz Island from a Mediterranean restaurant in San Francisco with hundred-dollar fish entrées on the menu. As I make small talk with other reporters, OpenAI CEO Sam Altman jumps through the door on my left. Altman’s looking down at his bare iPhone to show us all something, and an intrusive thought slips out of my mouth: “No phone case is a bold choice.” Of course, I immediately realize that the billionaire CEO of OpenAI, who employs Apple veteran Jony Ive, cares more about preserving the iPhone’s original design than the $1,000 it costs to replace one. “Listen, we’re going to ship a device that is going to be so beautiful,” says Altman, referring toOpenAI and Ive’s forthcoming AI device. “If you put a case over it, I will personally hunt you down,” he jokes. Altman has gathered roughly a dozen tech reporters to join him and other OpenAI executives for an on-the-record dinner (and off-the-record dessert). The night raises more questions than it answers. For instance, why is Nick Turley, the VP of ChatGPT, kindly passing me a lamb skewer just a week after launchingGPT-5? Is this to encourage me to write nice things about OpenAI’s biggest AI model launch yet, which was relatively disappointing given the years of hype around it? Unlike GPT-4, which far outpaced rivals and challenged expectations of what AI can do, GPT-5 performs roughly on par with models from Google and Anthropic. OpenAI even broughtback GPT-4oandChatGPT’s model picker, after several users expressed concerns over GPT-5’s tone and its model router. But throughout the night, it becomes clear to me that this dinner is about OpenAI’s future beyond GPT-5. OpenAI’s executives give the impression that AI model launches are less important than they were when GPT-4 launched in 2023. After all, OpenAI is a very different company now, focused on upending legacy players in search, consumer hardware, and enterprise software. OpenAI shares some new details about those efforts. Altman says OpenAI’s incoming CEO of applications,Fidji Simo, will oversee multiple consumer apps outside of ChatGPT — ones OpenAI has yet to launch. Simo is slated to start work at OpenAI in just a few weeks, and she might end up overseeing the launch of anAI-powered browserthat OpenAI is reportedly developing to compete with Chrome. Altman suggests OpenAI would even consider buying Chrome — likely an offer that would be taken more seriously thanPerplexity’s bid— should it become available. “If Chrome is really going to sell, we should take a look at it,” he says before looking at all of us and asking: “Is it actually going to sell? I assumed it wasn’t gonna happen.”Simo also might end up running an AI-poweredsocial media app— something the OpenAI CEO has said he’s interested in exploring. In fact, Altman says there’s “nothing” inspiring to him about the way AI is used on social media today, adding that he’s interested in “whether or not it is possible to build a much cooler kind of social experience with AI.” While Turley and Brad Lightcap, OpenAI’s COO, largely give the floor to Altman, drinking wine alongside the other seated guests, Altman also confirms reports that OpenAI plans to back a brain-computer interface startup,Merge Labs, to compete with Elon Musk’s Neuralink. (“We have not done that deal yet; I would like us to.”) How intertwined that company will be with OpenAI’s models and devices remains to be seen. Altman describes it only as a “a company that we’d invest in.” For all the talk of browsers and brain chips, though, the elephant in the room remains GPT-5’s rough reception. Eventually, the conversation circles back to the model that has prompted our group dinner in the first place. Turley and Altman say they’ve learned a lot from the experience. “I legitimately just thought we screwed that up,” says Altman on deprecating GPT-4o without telling users. Altman says OpenAI will give users a more clear “transition period” when deprecating AI models in the future. Turley also says OpenAI is already rolling out a new update to make GPT-5’s responses “warmer,” but not sycophantic, such that it won’t reinforce negative behaviors in users. “GPT-5 was just very to the point. I like that. I use the robot personality — I’m German, you know, whatever,” says Turley. “But many people do not, and they really like the fact that ChatGPT would actually check in with you.” It’s a delicate balance for OpenAI to strike, especially given that some users have developed dependencies on ChatGPT. Altman says OpenAI believes that less than 1% of ChatGPT users have unhealthy relationships with the chatbot — which could still be tens of millions of people. Turley says OpenAI has worked with mental health experts to develop a rubric to evaluate GPT-5’s answers, ensuring that the AI model will push back on unhealthy behaviors. That said, it seems that GPT-5 hasn’t hurt OpenAI’s business. In fact, Altman says OpenAI’s API traffic doubled within 48 hours of GPT-5’s launch, and the company is effectively “out of GPUs” thanks to all the demand. Cursor and other AI coding assistants have since made GPT-5 their default AI models. In many ways, the night’s contradictions — disappointing launches, record-breaking usage — reflect OpenAI’s strange reality right now. Given OpenAI’s bets — and others the company is making around data centers, robotics, and energy — Altman clearly has ambitions of running a much bigger company than just the ChatGPT maker. The final form could look something like Google’s parent Alphabet, but perhaps even broader. As the night winds down, it becomes clear we aren’t gathered to reflect on GPT-5 at all. We are being pitched on a company that’s eager to outgrow its famous and controversial product. It seems likely that OpenAI will go public to meet its massive capital demands as part of that picture. In preparation, I think Altman wants to hone his relationship with the media. But he also wants OpenAI to get to a place where it’s no longer defined by its best AI model. Topics Senior AI Reporter Maxwell Zeff is a senior reporter at TechCrunch specializing in AI. Previously with Gizmodo, Bloomberg, and MSNBC, Zeff has covered the rise of AI and the Silicon Valley Bank crisis. He is based in San Francisco. When not reporting, he can be found hiking, biking, and exploring the Bay Area’s food scene. You can contact or verify outreach from Maxwell by emailingmaxwell.zeff@techcrunch.comor via encrypted message at mzeff.88 on Signal. Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/15/sam-altman-over-bread-rolls-explores-life-after-gpt-5/", "timestamp": "2025-08-18T11:09:19.438606", "sentiment_score": 0.017999999225139618, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "How your solar rooftop became a national security issue", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us James Showalter describes a pretty specific if not entirely implausible nightmare scenario. Someone drives up to your house, cracks your Wi-Fi password, and then starts messing with the solar inverter mounted beside your garage — that unassuming gray box that converts the direct current from your rooftop panels into the alternating current that powers your home. “You’ve got to have a solar stalker” for this scenario to play out, says Showalter, describing the kind of person who would need to physically show up in your driveway with both the technical know-how and the motivation to hack your home energy system. Showalter, the CEO ofEG4 Electronics, a company based in Sulphur Springs, Texas, doesn’t consider this sequence of events particularly likely. Still, it’s why his company last week found itself in the spotlight when U.S. cybersecurity agency CISApublished an advisorydetailing security vulnerabilities in EG4’s solar inverters. The flaws, CISA noted, could allow an attacker with access to the same network as an affected inverter and its serial number to intercept data, install malicious firmware, or seize control of the whole system. For the roughly 55,000 customers who own EG4’s affected inverter model, the episode probably felt like an unsettling introduction to a device that they little understand. What they’re learning is that modern solar inverters aren’t simple power converters anymore. They now serve as the backbone of home energy installations, monitoring performance, communicating with utility companies, and, when there’s excess power, feeding it back into the grid. Much of this has happened without people noticing. “Nobody knew what the hell a solar inverter was five years ago,” observes Justin Pascale, a principal consultant at Dragos, a cybersecurity firm that specializes in industrial systems. “Now we’re talking about it at the national and international level.” Some of the numbers highlight the degree to which individual homes in the U.S. are becoming miniature power plants. According to the U.S. Energy Information Administration, small-scale solar installations — primarily residential — grewmore than fivefoldbetween 2014 and 2022. What was once the province of climate advocates and early adopters became more mainstream owing to falling costs, government incentives, and a growing awareness of climate change. Each solar installation adds another node to an expanding network of interconnected devices, each one contributing to energy independence but also becoming a potential entry point for someone with malicious intent. When pressed about his company’s security standards, Showalter acknowledges its shortcomings, but he also deflects. “This is not an EG4 problem,” he says. “This is an industry-wide problem.” Over a Zoom call and later, in this editor’s inbox, he produced a14-page reportcataloguing 88 solar energy vulnerability disclosures across commercial and residential applications since 2019. Not all of his customers — some of whomtook to Redditto complain — are sympathetic, particularly given that CISA’s advisory revealed fundamental design flaws: communication between monitoring applications and inverters that occurred in unencrypted plain text, firmware updates that lacked integrity checks, and rudimentary authentication procedures. “These were fundamental security lapses,” says one customer of the company, who asked to speak anonymously. “Adding insult to injury,” continues this individual, “EG4 didn’t even bother to notify me or offer suggested mitigations.” Asked why EG4 didn’t alert customers straightaway when CISA reached out to the company, Showalter calls it a “live and learn” moment. “Because we’re so close [to addressing CISA’s concerns] and it’s such a positive relationship with CISA, we were going to get to the ‘done’ button, and then advise people, so we’re not in the middle of the cake being baked,” says Showalter. TechCrunch reached out to CISA earlier this week for more information; the agency has not responded. In its advisory about EG4, CISA states that “no known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.” While unrelated, the timing of EG4’s public relations crisis coincides with broader anxieties about the supply chain security of renewable energy equipment. Earlier this year, U.S. energy officials reportedly began reassessing risks posed by devices made in China after discovering unexplained communication equipment inside some inverters and batteries.According to a Reuters investigation, undocumented cellular radios and other communication devices were found in equipment from multiple Chinese suppliers — components that hadn’t appeared on official hardware lists. This reported discovery carries particular weight given China’s dominance in solar manufacturing. That same Reuters story noted that Huawei is the world’s largest supplier of inverters, accounting for 29% of shipments globally in 2022, followed by Chinese peers Sungrow and Ginlong Solis. Some200 GW of European solar power capacityis linked to inverters made in China, which is roughly equivalent to more than 200 nuclear power plants.The geopolitical implications haven’t escaped notice. Lithuania last yearpassed a lawblocking remote Chinese access to solar, wind, and battery installations above 100 kilowatts, effectively restricting the use of Chinese inverters. Showalter says his company is responding to customer concerns by similarly starting to move away from Chinese suppliers and toward components made by companies elsewhere, including in Germany. But the vulnerabilities CISA described in EG4’s systems raise questions that extend beyond any single company’s practices or where it sources its components. The U.S. standards agency NISTwarnsthat “if you remotely control a large enough number of home solar inverters, and do something nefarious at once, that could have catastrophic implications to the grid for a prolonged period of time.” The good news (if there is any), is that while theoretically possible, this scenario faces a lot of practical limitations. Pascale, who works with utility-scale solar installations, notes that residential inverters serve primarily two functions: converting power from direct to alternating current, and facilitating the connection back to the grid. A mass attack would require compromising vast numbers of individual homes simultaneously. (Such attacks are not impossible but are more likely to involve targeting the manufacturers themselves, some of which have remote access to their customers’ solar inverters, asevidenced by security researchers last year.) The regulatory framework that governs larger installations does not right now extend to residential systems. The North American Electric Reliability Corporation’s Critical Infrastructure Protection standardscurrently applyonly to larger facilities producing 75 megawatts or more, like solar farms. Because residential installations fall so far below these thresholds, they operate in a regulatory gray zone where cybersecurity standards remain suggestions rather than requirements. But the end result is that the security of thousands of small installations depends largely on the discretion of individual manufacturers that are operating in a regulatory vacuum. On the issue of unencrypted data transmission, for example, which is one reason EG4 received that slap on the hand from CISA, Pascale notes that in utility-scale operational environments, plain text transmission is common and sometimes encouraged for network-monitoring purposes. “When you look at encryption in an enterprise environment, it is not allowed,” he explains. “But when you look at an operational environment, most things are transmitted in plain text.” Put another way, the real concern isn’t an immediate threat to individual homeowners. Instead it ties to the aggregate vulnerability of a rapidly expanding network. As the energy grid becomes increasingly distributed, with power flowing from millions of small sources rather than dozens of large ones, the attack surface expands exponentially. Each inverter represents a potential pressure point in a system that was never designed to accommodate this level of complexity. Showalter has embraced CISA’s intervention as what he calls a “trust upgrade” — an opportunity to differentiate his company in a crowded market. He says that since June, EG4 has worked with the agency to address the identified vulnerabilities, reducing an initial list of 10 concerns to three remaining items that the company expects to resolve by October. The process has involved updating firmware transmission protocols, implementing additional identity verification for technical support calls, and redesigning authentication procedures. But for those like the anonymous EG4 customer who spoke with frustration about the company’s response, the episode highlights the odd position that solar adopters find themselves in. They purchased what they understood to be climate-friendly tech, only to discover they’d become unwitting participants in a knotty cybersecurity landscape that few seem to fully comprehend. Topics Editor in Chief & General Manager Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/15/how-your-solar-rooftop-became-a-national-security-issue/", "timestamp": "2025-08-18T11:09:20.522023", "sentiment_score": -0.10019999742507935, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "Duolingo CEO says controversial AI memo was misunderstood", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Posted: While Duolingo CEO Luis von Ahn was loudly criticized this year afterdeclaring that Duolingo would become an “AI-first company,”he suggested in a new interview the real issue was that he “did not give enough context.” “Internally, this was not controversial,”von Ahn told The New York Times. “Externally, as a publicly traded company some people assume that it’s just for profit. Or that we’re trying to lay off humans. And that was not the intent at all.” On the contrary, von Ahn said the company has “never laid off any full-time employees” and has no intention of doing so. And while he didn’t deny that Duolingo hadcut its contractor workforce, he suggested that “from the beginning … our contractor workforce has gone up and down depending on needs.” Despite the criticism (whichdoes not seem to have made a big impacton Duolingo’s bottom line), von Ahn still sounds extremely bullish about A.I.’s potential, with Duolingo team members taking every Friday morning to experiment with the technology. “It’s a bad acronym, f-r-A-I-days,” he said. “I don’t know how to pronounce it.” Topics Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Subscribe for the industry’s biggest tech news Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility is your destination for transportation news and insight. Startups are the core of TechCrunch, so get our best coverage delivered weekly. Provides movers and shakers with the info they need to start their day. By submitting your email, you agree to ourTermsandPrivacy Notice. © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/17/duolingo-ceo-says-controversial-ai-memo-was-misunderstood/", "timestamp": "2025-08-18T11:09:21.643894", "sentiment_score": -0.9072999954223633, "symbol": "MSFT"}
{"source": "CNBC", "title": "European stocks move lower ahead of Trump-Ukraine crunch talks", "content": "LONDON — European stocks lost some ground on Monday as traders looked ahead to a meeting between regional leaders and U.S. President Donald Trump to discuss Ukraine.The pan-EuropeanStoxx 600index was 0.2% lower by 11:19 a.m. in London (6:19 a.m. ET), with most sectors and all major bourses in negative territory. European leaders, including German Chancellor Friedrich Merz, French President Emmanuel Macron and British Prime Minister Keir Starmer, are traveling with Ukraine's Volodymyr Zelenskyy to Washington to meet Trump at the White House to discuss a peace deal.Zelenskyy is likely to come under pressure to enter a deal.In a post on Truth Social,Trump said the president could \"end the war with Russia almost immediately, if he wants to, or he can continue to fight.\"The meeting follows Trump's summit with Russian President Vladimir Putin last Friday, but the talks concluded without a ceasefire. It's been widely reported since then that Putin told Trump that he would agree to one,if Russia was handed Ukraine's eastern Donbas region. On Sunday, U.S. special envoySteve Witkoffsuggested Ukrainecould be given some security guaranteesto bring an end to the war. Looking at individual stocks, shares of Danish wind turbine manufacturerVestas Windsurged 16.5% by 11:20 a.m. in London, taking the company to the top of the Stoxx 600.The gain came after the U.S. Internal Revenue Serviceissued new rulesaround tax credits for clean energy projects. Under the new system, developers will only be able to qualify once physical work on the project begins. Previously, they were able to claim tax relief by paying at least 5% of project costs and demonstrating that some form of work on the project was ongoing.Meanwhile, shares of Danish pharmaceutical giantNovo Nordiskwere up by 4% after the company's blockbuster weight-loss drug Wegovywon regulatory approvalin the United States to treat a serious liver disease.At the other end of the Stoxx 600,Commerzbankwas 3.3% lower in late morning trade in London.The German lender was downgraded by strategists at Deutsche Bank on Monday, who lowered the stock from a \"buy\" rating to a \"hold.\"\"We continue to like the fundamental Commerzbank story, including rising profitability and capital return, as well as the upcoming benefits from the German fiscal stimulus,\" Deutsche Bank's Benjamin Goy said in a note. \"Nevertheless, after tripling over the last year, the shares now trade at a 20% to 42% P/E premium to the sector, even on our above-consensus forecasts.\"Overnight,Asia-Pacific marketsmostly rose ahead of the talks, whileU.S. stock futurestraded slightly higher early Monday after hopes for lower interest rates fueled a winning week on Wall Street.There are no major earnings on Monday. Data releases include Spanish and EU trade balance figures.", "url": "https://www.cnbc.com/2025/08/18/european-markets-on-mon-aug-18-stoxx-600-dax-cac-ftse-stocks.html", "timestamp": "2025-08-18T11:28:37.725893", "sentiment_score": -0.8515999913215637, "symbol": "WELL"}
{"source": "CNBC", "title": "Traders hope the Ukraine war ends soon. Experts say there's no 'quick fix'", "content": "Global markets were on tenterhooks Monday as momentum to end the war in Ukraine ramped up.Experts warn there is no \"quick fix,\" however, and talks could last years.European leaders and Ukraine's Volodymyr Zelenskyy are heading to Washington for more discussions with U.S. President Donald Trump on ending the war in Ukraine. Global markets were on tenterhooks Monday as momentum to end the war in Ukraine appeared to be ramping up, with European leaders heading to Washington for more talks with U.S. President Donald Trump on ending the war in Ukraine.European markets traded mixedahead of the summit later today at the White House, which followsTrump's high-profile meeting with Russian President Vladimir Putinin Alaska on Friday, whileU.S. stock futures had moved lower.Meanwhile,Asia-Pacific indicesovernight traded mostly higher in anticipation of the talks.Traders will be hoping that an end to the Russia-Ukraine war — a conflict which began in 2022 and which has shaken the global economy, disrupting trade and supply chains, and creating geopolitical chasms between major economies in the West and East — could be nearer now than at any other time.But those in the know say fledgling talks between stakeholders Russia, Ukraine, Europe and the U.S. are just the beginning of what could be a long and thorny path to a ceasefire — as Trump's inconclusive talks with Putin on Friday proved — let alone peace.That would be in stark contrast to Trump's well-documented love of a quick deal, and should be a wake-up call for global market optimism, experts say.\"Peace agreements take a very, very long time to achieve,\" James Bindenagel, visiting fellow at the German Marshall Fund and former U.S. ambassador to Germany, told CNBC Monday. \"And what Putin has said is that he wants peace talks so he can continue the war, knowing that it won't come to a peace agreement for a very long time. That is simply not acceptable,\" he said.\"You cannot negotiate on a peace agreement for five years, ten years, and let the Russians continue their war against the Ukrainians.\" European Commission President Ursula von der Leyen, NATO chief Mark Rutte, German Chancellor Friedrich Merz, French President Emmanuel Macron and British Prime Minister Keir Starmer are among the European leaders traveling to Washington for talks on Monday.They're accompanying Ukraine's President Volodymyr Zelenskyy to discuss Ukraine's future and possible conditions for a peace deal, including land swaps (reportedly proposed by Putin) and security guarantees — all seen as crucial by Europe, if there is to be a ceasefire and peace. Trump has ruled out the possibility of Ukraine regaining control of Crimea, which Russia invaded in 2014, and joining NATO. Zelenskyy is likely to come under pressure to enter a deal.In a post on Truth Social,Trump said the Ukrainian president could \"end the war with Russia almost immediately, if he wants to, or he can continue to fight.\"The meeting follows Trump's summit with Russian President Vladimir Putin last Friday, but the talks concluded without a ceasefire. It's been widely reported since then that Putin told Trump that he would agree to one,if Russia was handed Ukraine's eastern Donbas region.The view from Ukraine is not optimistic, considering that Putin had already rejected the offer of a ceasefire that could form the basis of peace negotiations. \"To achieve a big peace deal is much more difficult,\" Oleksiy Goncharenko, a Ukrainian lawmaker, told CNBC on Monday. \"It's a difficult question with big details and it will take a lot of time,\" he told CNBC's \"Europe Early Edition.\" European defense stocks were in focus Monday, with traders betting on a positive outlook for the sector whatever the outcome of talks as European leaders have pledged to increase defense spending.On Monday, Germany'sRheinmetallwas up 2.8%, whileHensoldtandRenkwere also around 4% higher, respectively. Italian firm Leonardo was up 2.1% in early deals while London-listedBAE Systemsalso traded 2.3% higher andBabcock3.4% higher.\"This is the beginning of a long negotiation,\" Olivia Allison, senior advisor at PRISM Strategic Intelligence, told CNBC Monday. \"Anyone looking for a quick fix will be disappointed,\" she noted. \"Regardless of the outcome ... there will be an emphasis on defense, on protecting critical national infrastructure, and I think the markets should also take that into account,\" she noted.\"A peace deal, which I think will be a long process, is not an end to the relationship between Russia and Europe.\"", "url": "https://www.cnbc.com/2025/08/18/markets-hope-ukraine-war-could-end-experts-say-theres-no-quick-fix.html", "timestamp": "2025-08-18T11:28:41.955233", "sentiment_score": -0.5778999924659729, "symbol": "WELL"}
{"source": "CNBC", "title": "Morgan Stanley maintains bullish stance on Nvidia heading into earnings, raises price target", "content": " Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. ©2025CNBC LLC. All Rights Reserved.A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis. Data also provided by", "url": "https://www.cnbc.com/2025/08/18/morgan-stanley-maintains-bullish-stance-on-nvidia-heading-into-earnings-raises-price-target.html", "timestamp": "2025-08-18T11:28:43.150080", "sentiment_score": -0.013799999840557575, "symbol": "NWSA"}
{"source": "CoinDesk", "title": "Metaplanet Expands Bitcoin Treasury by 775 BTC, Assets Outweigh Debt 18-Fold", "content": "Tokyo-listedMetaplanet Inc(3350)has acquired an additional 775 bitcoinBTC$115,062.31for 13.73 billion yen(about $94 million), according to its most recent filing. The purchase, made at an average price of 17.72 million yen($120,500)per bitcoin, lifts the company’s total holdings to 18,888 BTC, worth roughly 284.1 billion yen($1.95 billion). This purchase keeps them as the seventh largest bitcoin treasury company. Across all purchases, Metaplanet’s average acquisition cost now stands at 15.04 million yen per BTC($102,100). The company reported a Bitcoin Yield of 29.3% for the latest period, down from 129.4% in Q2. Its multiple to net asset value remains near 2, the lowest since it began its BTC accumulation. The company carries $117 million in outstanding debt, Metaplanet’s leverage is minimal compared to its bitcoin reserves. “Metaplanet now hold $2.18 billion in BTC against just $120 million of outstanding 0% ordinary bonds,” saidDylan LeClair, director of bitcoin strategy. “Our 19th Series Ordinary Bonds are 18.67x over-collateralized by our BTC position, and currently represent the sole liability within our capital structure.” Shares of Metaplanet rose 4% to close at 900 yen on Monday, even as bitcoin slipped to$115,500, reflecting investor confidence in the firm’s balance sheet strategy. James Van Stratenis a Senior Analyst at CoinDesk, specializing in Bitcoin and its interplay with the macroeconomic environment. Previously, James worked as a Research Analyst at Saidler & Co., a Swiss hedge fund, where he developed expertise in on-chain analytics. His work focuses on monitoring flows to analyze Bitcoin's role within the broader financial system. In addition to his professional endeavors, James serves as an advisor to Coinsilium, a UK publicly traded company, where he provides guidance on their Bitcoin treasury strategy. He also holds investments in Bitcoin and Strategy (MSTR). More For You Bitcoin Drops Below $115K Amid Wave of Profit-Taking Approximately, $3.5B of profit realized over the weekend, latest correction trims 7% from ATH. What to know: About Contact", "url": "https://www.coindesk.com/markets/2025/08/18/metaplanet-expands-bitcoin-treasury-by-775-btc-assets-outweigh-debt-18-fold", "timestamp": "2025-08-18T11:28:55.085628", "sentiment_score": -0.86080002784729, "symbol": "COST"}
{"source": "CoinDesk", "title": "Solana Briefly Hits 100K TPS Under Stress Load, Boosting SOL Appeal", "content": "Solana briefly recorded more than 100,000 transactions per second(TPS)on its mainnet over the weekend,block datashows.  A block processed 43,016 successful transactions and 50 failed ones for a peak of 107,540 TPS, facilitated and processed by validator “Cavey Cool.”  Solana just did 107,540 TPS on mainnetyes, you read that correctlyover 100k TPS, on mainnetgood luck bearspic.twitter.com/nGF9Q1b86c  The spike was driven by no-operation, or “noop,” program calls, or lightweight instructions required in every transaction that don’t change state but can be used to stress-test network capacity.  Critics argue that such loads are artificial. But Helius CEO Mert Mumtaz said in an X post that the cost to the network wasn’t trivial: While execution compute units(CUs)are low, the “total cost” also accounts for signature verification, data loading and other non-execution overhead. That makes them comparable to a low-cost oracle update, rather than meaningless spam. there are also some technical details around thise.g one might point out the nature of the CUs for these calls, but it's more nuanced since there's also a \"total cost\" component to these (sig verify, data loading, etc) which also takes into account non-execution CUsand as…  As such, actual user-facing throughput is far lower as of Monday morning. On-chain trackerSolscan shows an average of 3,500 TPS, nearly two-thirds of which are validator vote transactions. Chainspect and Solscan peg effective throughput for payments and applications at roughly 1,000 TPS. Still, the data showed that Solana could theoretically sustain 80,000–100,000 TPS in real operations like transfers or oracle updates under peak conditions — improving the appeal of the network’s SOL(SOL)token. Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.Shaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.He provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. More For You Bitcoin Drops Below $115K Amid Wave of Profit-Taking Approximately, $3.5B of profit realized over the weekend, latest correction trims 7% from ATH. What to know: About Contact", "url": "https://www.coindesk.com/markets/2025/08/18/solana-briefly-hits-100k-tps-under-stress-load-boosting-sol-appeal", "timestamp": "2025-08-18T11:28:56.444944", "sentiment_score": -0.09269999712705612, "symbol": "ORCL"}
{"source": "CoinDesk", "title": "Ether Market May Become More Exciting Below $4.2K. Here Is Why.", "content": "Crypto traders should remain vigilant for an ether(ETH)price drop below $4,200, which could trigger millions in long liquidations and increase market volatility. As of writing, over 56,638 ETH in bullish long positions – valued at $236 million – faced liquidation risk on the decentralized perpetual exchange Hyperliquid in case of an ether price drop to $4,170, according to data from Hyperdash. The data also showed a risk of sizable liquidations at $2,150-$2,160 and $3,940. At press time, ether changed hands at $4,260, down nearly 5% on the day, according to CoinDesk data. Andrew Kang, founder of the crypto venture capital firm Mechanism Capital, stated on X that large long liquidations could potentially drive ether prices down to $3,600. \"[I] would estimate we're about to hit $5b in ETH liquidations across exchanges, taking us down to $3.2k - $3.6k,\" Kang said. Liquidations, or the forced closure of leveraged bets, happen when a trader's position falls short of the margin requirements set by the exchange. The margin shortage typically occurs when the market moves against the trader's position, causing their account equity to fall below the minimum maintenance margin. This prompts the exchange to automatically close the position to prevent further losses and ensure borrowed funds are recovered. Largely long liquidations cause a sudden surge in selling pressure, which pushes prices even lower, creating a cascading effect that can trigger additional liquidations. This negative feedback loop tends to amplify market volatility. Read more:Dogecoin Sellers in Control as Monero Attacker Votes to Target DOGE; Bitcoin Below $116K Omkar Godbole is a Co-Managing Editor and analyst on CoinDesk's Markets team. He has been covering crypto options and futures, as well as macro and cross-asset activity, since 2019, leveraging his prior experience in directional and non-directional derivative strategies at brokerage firms. His extensive background also encompasses the FX markets, having served as a fundamental analyst at currency and commodities desks for Mumbai-based brokerages and FXStreet. Omkar holds small amounts of bitcoin, ether, BitTorrent, tron and dot.Omkar holds a Master's degree in Finance and a Chartered Market Technician (CMT) designation. “AI Boost” indicates a generative text tool, typically an AI chatbot, contributed to the article. In each and every case, the article was edited, fact-checked and published by a human.Read more about CoinDesk's AI Policy. More For You Bitcoin Drops Below $115K Amid Wave of Profit-Taking Approximately, $3.5B of profit realized over the weekend, latest correction trims 7% from ATH. What to know: About Contact", "url": "https://www.coindesk.com/markets/2025/08/18/ether-market-may-become-more-exciting-below-usd4-2k-here-is-why", "timestamp": "2025-08-18T11:28:57.819526", "sentiment_score": -0.9567999839782715, "symbol": "TGT"}
{"source": "Financial Times", "title": "Citi raid on JPMorgan investment bankers reaches double digits", "content": " Arash Massoudiin London andAkila Quinioin New York PublishedAugust 18 2025 Simply sign up to theUS banksmyFT Digest -- delivered directly to your inbox. Citigroup’s banking chief Vis Raghavan has accelerated a hiring spree of former JPMorgan Chase colleagues, with at least 10 senior investment bankers having now agreed to join the rival US bank. In the past month, Citi has named Amit Nayyar as co-head of European technology banking, Guillermo Baygual as co-head of global M&A, Pankaj Goel as co-head of technology investment banking, BJ Vargas as head of North American equity capital markets and Ashish Agarwal as a senior real estate banker. All five men held senior roles in JPMorgan’s investment bank. Raghavan worked at JPMorgan for more than 20 years, and was named global head of investment banking there before he quit to lead the turnaround of Citi’s corporate, commercial and investment banking business. The latest recruits joina cohort of fiveother ex-JPMorgan bankers who have already taken up senior roles in Citi’s investment bank. Chief among those was Achintya Mangla, widely seen as Raghavan’s trusted lieutenant at JPMorgan, who now heads financing for investment banking at Citi. Raghavan started at Citi in June last year, and the bank’s recruitment effort has gone into overdrive since his non-solicit agreement with JPMorgan expired. David Lomer, who worked with Raghavan until 2022 when he moved to private capital group ICG, is also expected to make the jump to Citi, according to people with knowledge of the matter. Lomer, who served as head of ICG’s UK, Nordics and Benelux markets, has already resigned and is on gardening leave until later this year, some of the people said. ICG and Citi declined to comment. “What’s unusual here is the speed with which it is happening,” one veteran investment banker said about the recruitment drive. “The first thing you are trying to do is upgrade your talent. The second thing is political. You put your people in place so that your lieutenants can push your agenda forward in a large and complex organisation.” Citi has also recruited from outside Raghavan’s former colleagues at JPMorgan, with three senior hires from Goldman Sachs. Those include David Friedland, a partner who left the bank after 25 years to become co-head of North America investment banking coverage. The bank has also brought in Aashish Dhakad from Ares Management, as it seeks to grow its direct lending business through a $25bn private credit venture with Apollo. Citi’s investment bank has gained market share in the last year and ranks fifth globally in investment banking revenue with a 4.5 per cent market share according to Dealogic. Speaking at a conference organised by Morgan Stanley in June, Raghavan attributed the climb to the fact the bank was “hiring a lot of people” and said Citi was “just getting started in terms of talent investment”. Its investment banking fees rose 13 per cent in the second quarter as the bank advised on high-profile deals, including Nippon Steel’s $15bn acquisition of US Steel and Boeing’s sale of parts of its aviation software unit to Thoma Bravo. JPMorgan recently said it has hired more than 300 bankers since early 2024. A person close to the bank added that nearly a third of those roles were at managing director level.", "url": "https://www.ft.com/content/537018c0-0d04-4229-82b4-95809aac0e0e", "timestamp": "2025-08-18T11:29:04.939492", "sentiment_score": 0.16110000014305115, "symbol": "JPM"}
{"source": "TechCrunch", "title": "‘Stranger Things’ creators may be leaving Netflix", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Netflix could soon lose the creative team behind one of its biggest hits. Earlier this week, Variety and other Hollywood publications reported that Matt and Ross Duffer, the brothers who created “Stranger Things” (and wrote and directed many episodes), werein talks to sign an exclusive deal with Paramount(nowunder the ownership of David Ellison’s Skydance). Then on Friday evening,Puck’s Matthew Belloni postedthat the Duffers had in fact “made their choice” and were going to Paramount. The Duffer Brothers’ ambition seems to have increased with each season of “Stranger Things,” as episodes have grown longer, set pieces have become more spectacular, and the budget has grown accordingly, witha reported Season 4 cost of $30 million per episode. So it’s not surprising that the Duffers are interested in making big-budget, tentpole movies next — an area where Netflix has struggled, in part due to its thorny relationship with the theatrical business, which co-CEOTed Sarandos recently describedas an “outdated concept.” While Netflix does release some movies in theaters, it has resisted giving those releases a significant exclusive window before launching on streaming, which means Netflix movies usually aren’t shown by the major chains. This was, apparently, a sticking point for “Barbie” director Greta Gerwig, so the first of her “Narnia” movies for Netflix willplay exclusively on Imax screensfor two weeks (or more) before going to streaming on Christmas Day 2026. And it seems this was also important to the Duffers, with Belloni reporting that the “theatrical component” turned out to be the “dealbreaker” in their negotiations. The brothers’ absence will not be immediately noticeable on Netflix, which will be releasing the final season of “Stranger Things” in three (!) parts later this year, and where the Duffers have two new shows scheduled to launch in 2026. Plus, the “Stranger Things” empire is growing, witha prequelplaying on Broadway,an animated seriescoming soon, and a live action spinoff reportedly in the works. Topics Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/17/stranger-things-creators-may-be-leaving-netflix/", "timestamp": "2025-08-18T11:29:10.307568", "sentiment_score": -0.8694999814033508, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Anthropic hasannounced new capabilitiesthat will allow some of its newest, largest models to end conversations in what the company describes as “rare, extreme cases of persistently harmful or abusive user interactions.” Strikingly, Anthropic says it’s doing this not to protect the human user, but rather the AI model itself. To be clear, the company isn’t claiming that its Claude AI models are sentient or can be harmed by their conversations with users. In its own words, Anthropic remains “highly uncertain about the potential moral status of Claude and other LLMs, now or in the future.” However, its announcement points toa recent program created to study what it calls “model welfare” and says Anthropic is essentially taking a just-in-case approach, “working to identify and implement low-cost interventions to mitigate risks to model welfare, in case such welfare is possible.” This latest change is currently limited to Claude Opus 4 and 4.1. And again, it’s only supposed to happen in “extreme edge cases,” such as “requests from users for sexual content involving minors and attempts to solicit information that would enable large-scale violence or acts of terror.” While those types of requests could potentially create legal or publicity problems for Anthropic itself (witness recent reporting around howChatGPT can potentially reinforce or contribute to its users’ delusional thinking), the company says that in pre-deployment testing, Claude Opus 4 showed a “strong preference against” responding to these requests and a “pattern of apparent distress” when it did so. As for these new conversation-ending capabilities, the company says, “In all cases, Claude is only to use its conversation-ending ability as a last resort when multiple attempts at redirection have failed and hope of a productive interaction has been exhausted, or when a user explicitly asks Claude to end a chat.” Anthropic also says Claude has been “directed not to use this ability in cases where users might be at imminent risk of harming themselves or others.” When Claude does end a conversation, Anthropic says users will still be able to start new conversations from the same account, and to create new branches of the troublesome conversation by editing their responses. “We’re treating this feature as an ongoing experiment and will continue refining our approach,” the company says. Topics Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/16/anthropic-says-some-claude-models-can-now-end-harmful-or-abusive-conversations/", "timestamp": "2025-08-18T11:29:11.421064", "sentiment_score": -0.05220000073313713, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "Sam Altman, over bread rolls, explores life after GPT-5", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us I’m looking out at Alcatraz Island from a Mediterranean restaurant in San Francisco with hundred-dollar fish entrées on the menu. As I make small talk with other reporters, OpenAI CEO Sam Altman jumps through the door on my left. Altman’s looking down at his bare iPhone to show us all something, and an intrusive thought slips out of my mouth: “No phone case is a bold choice.” Of course, I immediately realize that the billionaire CEO of OpenAI, who employs Apple veteran Jony Ive, cares more about preserving the iPhone’s original design than the $1,000 it costs to replace one. “Listen, we’re going to ship a device that is going to be so beautiful,” says Altman, referring toOpenAI and Ive’s forthcoming AI device. “If you put a case over it, I will personally hunt you down,” he jokes. Altman has gathered roughly a dozen tech reporters to join him and other OpenAI executives for an on-the-record dinner (and off-the-record dessert). The night raises more questions than it answers. For instance, why is Nick Turley, the VP of ChatGPT, kindly passing me a lamb skewer just a week after launchingGPT-5? Is this to encourage me to write nice things about OpenAI’s biggest AI model launch yet, which was relatively disappointing given the years of hype around it? Unlike GPT-4, which far outpaced rivals and challenged expectations of what AI can do, GPT-5 performs roughly on par with models from Google and Anthropic. OpenAI even broughtback GPT-4oandChatGPT’s model picker, after several users expressed concerns over GPT-5’s tone and its model router. But throughout the night, it becomes clear to me that this dinner is about OpenAI’s future beyond GPT-5. OpenAI’s executives give the impression that AI model launches are less important than they were when GPT-4 launched in 2023. After all, OpenAI is a very different company now, focused on upending legacy players in search, consumer hardware, and enterprise software. OpenAI shares some new details about those efforts. Altman says OpenAI’s incoming CEO of applications,Fidji Simo, will oversee multiple consumer apps outside of ChatGPT — ones OpenAI has yet to launch. Simo is slated to start work at OpenAI in just a few weeks, and she might end up overseeing the launch of anAI-powered browserthat OpenAI is reportedly developing to compete with Chrome. Altman suggests OpenAI would even consider buying Chrome — likely an offer that would be taken more seriously thanPerplexity’s bid— should it become available. “If Chrome is really going to sell, we should take a look at it,” he says before looking at all of us and asking: “Is it actually going to sell? I assumed it wasn’t gonna happen.”Simo also might end up running an AI-poweredsocial media app— something the OpenAI CEO has said he’s interested in exploring. In fact, Altman says there’s “nothing” inspiring to him about the way AI is used on social media today, adding that he’s interested in “whether or not it is possible to build a much cooler kind of social experience with AI.” While Turley and Brad Lightcap, OpenAI’s COO, largely give the floor to Altman, drinking wine alongside the other seated guests, Altman also confirms reports that OpenAI plans to back a brain-computer interface startup,Merge Labs, to compete with Elon Musk’s Neuralink. (“We have not done that deal yet; I would like us to.”) How intertwined that company will be with OpenAI’s models and devices remains to be seen. Altman describes it only as a “a company that we’d invest in.” For all the talk of browsers and brain chips, though, the elephant in the room remains GPT-5’s rough reception. Eventually, the conversation circles back to the model that has prompted our group dinner in the first place. Turley and Altman say they’ve learned a lot from the experience. “I legitimately just thought we screwed that up,” says Altman on deprecating GPT-4o without telling users. Altman says OpenAI will give users a more clear “transition period” when deprecating AI models in the future. Turley also says OpenAI is already rolling out a new update to make GPT-5’s responses “warmer,” but not sycophantic, such that it won’t reinforce negative behaviors in users. “GPT-5 was just very to the point. I like that. I use the robot personality — I’m German, you know, whatever,” says Turley. “But many people do not, and they really like the fact that ChatGPT would actually check in with you.” It’s a delicate balance for OpenAI to strike, especially given that some users have developed dependencies on ChatGPT. Altman says OpenAI believes that less than 1% of ChatGPT users have unhealthy relationships with the chatbot — which could still be tens of millions of people. Turley says OpenAI has worked with mental health experts to develop a rubric to evaluate GPT-5’s answers, ensuring that the AI model will push back on unhealthy behaviors. That said, it seems that GPT-5 hasn’t hurt OpenAI’s business. In fact, Altman says OpenAI’s API traffic doubled within 48 hours of GPT-5’s launch, and the company is effectively “out of GPUs” thanks to all the demand. Cursor and other AI coding assistants have since made GPT-5 their default AI models. In many ways, the night’s contradictions — disappointing launches, record-breaking usage — reflect OpenAI’s strange reality right now. Given OpenAI’s bets — and others the company is making around data centers, robotics, and energy — Altman clearly has ambitions of running a much bigger company than just the ChatGPT maker. The final form could look something like Google’s parent Alphabet, but perhaps even broader. As the night winds down, it becomes clear we aren’t gathered to reflect on GPT-5 at all. We are being pitched on a company that’s eager to outgrow its famous and controversial product. It seems likely that OpenAI will go public to meet its massive capital demands as part of that picture. In preparation, I think Altman wants to hone his relationship with the media. But he also wants OpenAI to get to a place where it’s no longer defined by its best AI model. Topics Senior AI Reporter Maxwell Zeff is a senior reporter at TechCrunch specializing in AI. Previously with Gizmodo, Bloomberg, and MSNBC, Zeff has covered the rise of AI and the Silicon Valley Bank crisis. He is based in San Francisco. When not reporting, he can be found hiking, biking, and exploring the Bay Area’s food scene. You can contact or verify outreach from Maxwell by emailingmaxwell.zeff@techcrunch.comor via encrypted message at mzeff.88 on Signal. Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/15/sam-altman-over-bread-rolls-explores-life-after-gpt-5/", "timestamp": "2025-08-18T11:29:12.547390", "sentiment_score": 0.017999999225139618, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "How your solar rooftop became a national security issue", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us James Showalter describes a pretty specific if not entirely implausible nightmare scenario. Someone drives up to your house, cracks your Wi-Fi password, and then starts messing with the solar inverter mounted beside your garage — that unassuming gray box that converts the direct current from your rooftop panels into the alternating current that powers your home. “You’ve got to have a solar stalker” for this scenario to play out, says Showalter, describing the kind of person who would need to physically show up in your driveway with both the technical know-how and the motivation to hack your home energy system. Showalter, the CEO ofEG4 Electronics, a company based in Sulphur Springs, Texas, doesn’t consider this sequence of events particularly likely. Still, it’s why his company last week found itself in the spotlight when U.S. cybersecurity agency CISApublished an advisorydetailing security vulnerabilities in EG4’s solar inverters. The flaws, CISA noted, could allow an attacker with access to the same network as an affected inverter and its serial number to intercept data, install malicious firmware, or seize control of the whole system. For the roughly 55,000 customers who own EG4’s affected inverter model, the episode probably felt like an unsettling introduction to a device that they little understand. What they’re learning is that modern solar inverters aren’t simple power converters anymore. They now serve as the backbone of home energy installations, monitoring performance, communicating with utility companies, and, when there’s excess power, feeding it back into the grid. Much of this has happened without people noticing. “Nobody knew what the hell a solar inverter was five years ago,” observes Justin Pascale, a principal consultant at Dragos, a cybersecurity firm that specializes in industrial systems. “Now we’re talking about it at the national and international level.” Some of the numbers highlight the degree to which individual homes in the U.S. are becoming miniature power plants. According to the U.S. Energy Information Administration, small-scale solar installations — primarily residential — grewmore than fivefoldbetween 2014 and 2022. What was once the province of climate advocates and early adopters became more mainstream owing to falling costs, government incentives, and a growing awareness of climate change. Each solar installation adds another node to an expanding network of interconnected devices, each one contributing to energy independence but also becoming a potential entry point for someone with malicious intent. When pressed about his company’s security standards, Showalter acknowledges its shortcomings, but he also deflects. “This is not an EG4 problem,” he says. “This is an industry-wide problem.” Over a Zoom call and later, in this editor’s inbox, he produced a14-page reportcataloguing 88 solar energy vulnerability disclosures across commercial and residential applications since 2019. Not all of his customers — some of whomtook to Redditto complain — are sympathetic, particularly given that CISA’s advisory revealed fundamental design flaws: communication between monitoring applications and inverters that occurred in unencrypted plain text, firmware updates that lacked integrity checks, and rudimentary authentication procedures. “These were fundamental security lapses,” says one customer of the company, who asked to speak anonymously. “Adding insult to injury,” continues this individual, “EG4 didn’t even bother to notify me or offer suggested mitigations.” Asked why EG4 didn’t alert customers straightaway when CISA reached out to the company, Showalter calls it a “live and learn” moment. “Because we’re so close [to addressing CISA’s concerns] and it’s such a positive relationship with CISA, we were going to get to the ‘done’ button, and then advise people, so we’re not in the middle of the cake being baked,” says Showalter. TechCrunch reached out to CISA earlier this week for more information; the agency has not responded. In its advisory about EG4, CISA states that “no known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time.” While unrelated, the timing of EG4’s public relations crisis coincides with broader anxieties about the supply chain security of renewable energy equipment. Earlier this year, U.S. energy officials reportedly began reassessing risks posed by devices made in China after discovering unexplained communication equipment inside some inverters and batteries.According to a Reuters investigation, undocumented cellular radios and other communication devices were found in equipment from multiple Chinese suppliers — components that hadn’t appeared on official hardware lists. This reported discovery carries particular weight given China’s dominance in solar manufacturing. That same Reuters story noted that Huawei is the world’s largest supplier of inverters, accounting for 29% of shipments globally in 2022, followed by Chinese peers Sungrow and Ginlong Solis. Some200 GW of European solar power capacityis linked to inverters made in China, which is roughly equivalent to more than 200 nuclear power plants.The geopolitical implications haven’t escaped notice. Lithuania last yearpassed a lawblocking remote Chinese access to solar, wind, and battery installations above 100 kilowatts, effectively restricting the use of Chinese inverters. Showalter says his company is responding to customer concerns by similarly starting to move away from Chinese suppliers and toward components made by companies elsewhere, including in Germany. But the vulnerabilities CISA described in EG4’s systems raise questions that extend beyond any single company’s practices or where it sources its components. The U.S. standards agency NISTwarnsthat “if you remotely control a large enough number of home solar inverters, and do something nefarious at once, that could have catastrophic implications to the grid for a prolonged period of time.” The good news (if there is any), is that while theoretically possible, this scenario faces a lot of practical limitations. Pascale, who works with utility-scale solar installations, notes that residential inverters serve primarily two functions: converting power from direct to alternating current, and facilitating the connection back to the grid. A mass attack would require compromising vast numbers of individual homes simultaneously. (Such attacks are not impossible but are more likely to involve targeting the manufacturers themselves, some of which have remote access to their customers’ solar inverters, asevidenced by security researchers last year.) The regulatory framework that governs larger installations does not right now extend to residential systems. The North American Electric Reliability Corporation’s Critical Infrastructure Protection standardscurrently applyonly to larger facilities producing 75 megawatts or more, like solar farms. Because residential installations fall so far below these thresholds, they operate in a regulatory gray zone where cybersecurity standards remain suggestions rather than requirements. But the end result is that the security of thousands of small installations depends largely on the discretion of individual manufacturers that are operating in a regulatory vacuum. On the issue of unencrypted data transmission, for example, which is one reason EG4 received that slap on the hand from CISA, Pascale notes that in utility-scale operational environments, plain text transmission is common and sometimes encouraged for network-monitoring purposes. “When you look at encryption in an enterprise environment, it is not allowed,” he explains. “But when you look at an operational environment, most things are transmitted in plain text.” Put another way, the real concern isn’t an immediate threat to individual homeowners. Instead it ties to the aggregate vulnerability of a rapidly expanding network. As the energy grid becomes increasingly distributed, with power flowing from millions of small sources rather than dozens of large ones, the attack surface expands exponentially. Each inverter represents a potential pressure point in a system that was never designed to accommodate this level of complexity. Showalter has embraced CISA’s intervention as what he calls a “trust upgrade” — an opportunity to differentiate his company in a crowded market. He says that since June, EG4 has worked with the agency to address the identified vulnerabilities, reducing an initial list of 10 concerns to three remaining items that the company expects to resolve by October. The process has involved updating firmware transmission protocols, implementing additional identity verification for technical support calls, and redesigning authentication procedures. But for those like the anonymous EG4 customer who spoke with frustration about the company’s response, the episode highlights the odd position that solar adopters find themselves in. They purchased what they understood to be climate-friendly tech, only to discover they’d become unwitting participants in a knotty cybersecurity landscape that few seem to fully comprehend. Topics Editor in Chief & General Manager Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. How your solar rooftop became a national security issue Co-founder of Elon Musk’s xAI departs the company Google CEO adds a new calendar feature at Stripe co-founder’s request NASA has sparked a race to develop the data pipeline to Mars Why I finally left Spotify How a once-tiny research lab helped Nvidia become a $4 trillion-dollar company iOS 26 beta 6 adds new ringtones, snappy app launches, and more © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/15/how-your-solar-rooftop-became-a-national-security-issue/", "timestamp": "2025-08-18T11:29:13.676244", "sentiment_score": -0.10019999742507935, "symbol": "MSFT"}
{"source": "TechCrunch", "title": "Duolingo CEO says controversial AI memo was misunderstood", "content": "Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Posted: While Duolingo CEO Luis von Ahn was loudly criticized this year afterdeclaring that Duolingo would become an “AI-first company,”he suggested in a new interview the real issue was that he “did not give enough context.” “Internally, this was not controversial,”von Ahn told The New York Times. “Externally, as a publicly traded company some people assume that it’s just for profit. Or that we’re trying to lay off humans. And that was not the intent at all.” On the contrary, von Ahn said the company has “never laid off any full-time employees” and has no intention of doing so. And while he didn’t deny that Duolingo hadcut its contractor workforce, he suggested that “from the beginning … our contractor workforce has gone up and down depending on needs.” Despite the criticism (whichdoes not seem to have made a big impacton Duolingo’s bottom line), von Ahn still sounds extremely bullish about A.I.’s potential, with Duolingo team members taking every Friday morning to experiment with the technology. “It’s a bad acronym, f-r-A-I-days,” he said. “I don’t know how to pronounce it.” Topics Put your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does. Subscribe for the industry’s biggest tech news Every weekday and Sunday, you can get the best of TechCrunch’s coverage. TechCrunch Mobility is your destination for transportation news and insight. Startups are the core of TechCrunch, so get our best coverage delivered weekly. Provides movers and shakers with the info they need to start their day. By submitting your email, you agree to ourTermsandPrivacy Notice. © 2025 TechCrunch Media LLC.", "url": "https://techcrunch.com/2025/08/17/duolingo-ceo-says-controversial-ai-memo-was-misunderstood/", "timestamp": "2025-08-18T11:29:14.838608", "sentiment_score": -0.9072999954223633, "symbol": "MSFT"}
